IQ_test = [
    {
        'text': '*1. Каким числом следует заменить знак вопроса?*\n\n25 29 33 37 41 ?',
        'buttons': [
            {'text' : '44', 'callback': '0'},
            {'text' : '43', 'callback': '0'},
            {'text' : '45', 'callback': '5.5'},
            {'text' : '46', 'callback': '0'},
            {'text' : '42', 'callback': '0'}
        ]
    },
    {
        'text': '*2. Что здесь является лишним?*',
        'buttons': [
            {'text' : 'ЛЕВ', 'callback': '0'},
            {'text' : 'ТИГР', 'callback': '0'},
            {'text' : 'ГЕПАРД', 'callback': '0'},
            {'text' : 'ПУМА', 'callback': '0'},
            {'text' : 'ГИЕНА', 'callback': '5.5'}
        ]
    },
    {
        'text': '*3. Какой буквой следует заменить знак вопроса?*\n\nБ Г Е Ж И ?',
        'buttons': [
            {'text' : 'К', 'callback': '5.5'},
            {'text' : 'М', 'callback': '0'},
            {'text' : 'Л', 'callback': '0'},
            {'text' : 'Ъ', 'callback': '0'},
            {'text' : 'Н', 'callback': '0'}
        ]
    },
    {
        'text': '*4. Определите название города, зашифрованного в анаграмме. В какой части России находится этот город?*\n\nНОСОВИК БРИ С',
        'buttons': [
            {'text' : 'УРАЛ', 'callback': '0'},
            {'text' : 'СИБИРЬ', 'callback': '5.5'},
            {'text' : 'ДАЛЬНИЙ ВОСТОК', 'callback': '0'},
            {'text' : 'ПРИВОЛЖЬЕ', 'callback': '0'},
            {'text' : 'СЕВЕРО-ЗАПАД', 'callback': '0'}
        ]
    },
    {
        'text': '*5. Найдите слово, которое необходимо вставить в скобки, чтобы закончить первое слово и начать последнее слово. Какую букву содержит это слово?*\n\nБАЛ ( . . . ) ТУР',
        'buttons': [
            {'text' : 'Т', 'callback': '0'},
            {'text' : 'М', 'callback': '0'},
            {'text' : 'С', 'callback': '0'},
            {'text' : 'Н', 'callback': '5.5'},
            {'text' : 'А', 'callback': '0'}
        ]
    },
    {
        'text': '*6. Какими двумя числами следует заменить знаки вопроса?*\n\n12 17 15 20 18 ? ?',
        'buttons': [
            {'text' : '20 22', 'callback': '0'},
            {'text' : '22 20', 'callback': '0'},
            {'text' : '23 20', 'callback': '0'},
            {'text' : '23 21', 'callback': '5.5'},
            {'text' : '24 21', 'callback': '0'}
        ]
    },
    {
        'text': '*7. Какие две буквы должны идти далее?*\n\nБ Д Е З И Л ? ?',
        'buttons': [
            {'text' : 'Н О', 'callback': '0'},
            {'text' : 'М П', 'callback': '5.5'},
            {'text' : 'Н П', 'callback': '0'},
            {'text' : 'М О', 'callback': '0'},
            {'text' : 'О Р', 'callback': '0'}
        ]
    },
    {
        'text': '*8. Сколько зеленых автомобилей в день производит автозавод?\n*\n\nАвтозавод производит 1000 кузовов в день для белых, черных, зеленых и красных автомобилей в пропорции  4 : 8 : 7 : 1  соответственно.',
        'buttons': [
            {'text' : '320', 'callback': '0'},
            {'text' : '340', 'callback': '0'},
            {'text' : '380', 'callback': '0'},
            {'text' : '365', 'callback': '0'},
            {'text' : '350', 'callback': '5.5'}
        ]
    },
    {
        'text': '*9. Расположите эти слова на семь правильных пар.*\n\nа)ПАС б)ВОЗ в)ДНЯ г)УНИ д)СО е)ОН ё)СЕГО ж)ПОРТ з)РАЙ и)ФОРМА й)ЯК к)ДУШНЫЙ л)ОБЩЕНИЕ м)МА',
        'buttons': [
            {'text' : '1)  а-ж   ё-к   б-в   г-и   д-л   з-е м-й', 'callback': '0'},
            {'text' : '2)  а-ж   б-к   ё-в   е-и   д-л   з-г   м-й', 'callback': '0'},
            {'text' : '3)  д-ж   б-к   ё-в   г-и   а-л   з-е   м-й', 'callback': '0'},
            {'text' : '4)  а-ж   б-к   м-в   г-и   д-л   з-е   ё-й', 'callback': '0'},
            {'text' : '5)  а-ж   б-к   ё-в   г-и   д-л   з-е   м-й', 'callback': '5.5'}
        ]
    },
    {
        'text': '*10. Найдите слово, которое необходимо вставить в скобки, чтобы закончить первое слово и начать последнее слово. Какую букву содержит это слово?*\n\nПАР ( . . ) ЛАДА',
        'buttons': [
            {'text' : 'Н', 'callback': '0'},
            {'text' : 'М', 'callback': '0'},
            {'text' : 'У', 'callback': '5.5'},
            {'text' : 'О', 'callback': '0'},
            {'text' : 'А', 'callback': '0'}
        ]
    },
    {
        'text': '*11. Какие два слова наиболее противоположны по смыслу?*\n\n1) ШИРОКИЙ\n2) ПЛАЧЕВНЫЙ\n3) СОЗЫВАТЬ\n4) ХВАЛИТЬ\n5) ПЕЧАЛЬНЫЙ\n6) УНИЖАТЬ\n7) ТРЕПЕТАТЬ\n8) ТОЛСТЫЙ',
        'buttons': [
            {'text' : '1 и 8', 'callback': '0'},
            {'text' : '2 и 7', 'callback': '0'},
            {'text' : '4 и 6', 'callback': '6.5'},
            {'text' : '3 и 5', 'callback': '0'},
            {'text' : '4 и 7', 'callback': '0'}
        ]
    },
    {
        'text': '*12. Какое слово должно стоять в нижних скобках? *\n\n13	20	(БОЛТ)	2	16\n18	20	( . . . . )	20	16',
        'buttons': [
            {'text' : 'ТОРГ', 'callback': '0'},
            {'text' : 'ВИНТ', 'callback': '0'},
            {'text' : 'БАНК', 'callback': '0'},
            {'text' : 'ТОРТ', 'callback': '6.5'},
            {'text' : 'ВОСК', 'callback': '0'}
        ]
    },
    {
        'text': '*13. Какие две буквы должны идти далее? *\n\nГ Т Ё Р И О ? ?',
        'buttons': [
            {'text' : 'К О', 'callback': '0'},
            {'text' : 'Л М', 'callback': '6.5'},
            {'text' : 'Л Н', 'callback': '0'},
            {'text' : 'М П', 'callback': '0'},
            {'text' : 'Л О', 'callback': '0'}
        ]
    },
    {
        'text': '*14. Каким числом следует заменить знак вопроса? *\n\n2 6 5 17\n3 4 7 19\n5 2 9 ?',
        'buttons': [
            {'text' : '19', 'callback': '6.5'},
            {'text' : '20', 'callback': '0'},
            {'text' : '21', 'callback': '0'},
            {'text' : '22', 'callback': '0'},
            {'text' : '18', 'callback': '0'}
        ]
    },
    {
        'text': '*15. Определите название города, зашифрованного в анаграмме. В какой стране находится этот город? *\n\nЛОТК МОСЬГ',
        'buttons': [
            {'text' : 'АНГЛИЯ', 'callback': '0'},
            {'text' : 'США', 'callback': '0'},
            {'text' : 'ШВЕЦИЯ', 'callback': '6.5'},
            {'text' : 'ФРАНЦИЯ', 'callback': '0'},
            {'text' : 'ИСПАНИЯ', 'callback': '0'}
        ]
    },
    {
        'text': '*16. Какими двумя числами следует заменить знаки вопроса? *\n\n2 8 6 24 18 ? ?',
        'buttons': [
            {'text' : '48 36', 'callback': '0'},
            {'text' : '58 42', 'callback': '0'},
            {'text' : '72 54', 'callback': '6.5'},
            {'text' : '61 48', 'callback': '0'},
            {'text' : '84 70', 'callback': '0'}
        ]
    },
    {
        'text': '*17. Что здесь является лишним? *',
        'buttons': [
            {'text' : 'СКОРОГОВОРКА', 'callback': '0'},
            {'text' : 'ПОСЛОВИЦА', 'callback': '0'},
            {'text' : 'ПОЭМА', 'callback': '6.5'},
            {'text' : 'ПОГОВОРКА', 'callback': '0'},
            {'text' : 'БАЙКА', 'callback': '0'}
        ]
    },
    {
        'text': '*18. Определите название города, зашифрованного в анаграмме. В какой части России находится этот город? *\n\nСЛИТОК ВВОД А',
        'buttons': [
            {'text' : 'ЦЕНТР', 'callback': '0'},
            {'text' : 'УРАЛ', 'callback': '0'},
            {'text' : 'СЕВЕРО-ЗАПАД', 'callback': '0'},
            {'text' : 'ДАЛЬНИЙ ВОСТОК', 'callback': '6.5'},
            {'text' : 'ЮГО-ЗАПАД', 'callback': '0'}
        ]
    },
    {
        'text': '*19. Какое слово не является анаграммой цветов? *',
        'buttons': [
            {'text' : 'НИЦ САР С', 'callback': '0'},
            {'text' : 'ОЗАР', 'callback': '0'},
            {'text' : 'ПЮЛЬ ТАН', 'callback': '0'},
            {'text' : 'ОР ШАК МА', 'callback': '0'},
            {'text' : 'ТОЛЬ ЧАН ОП', 'callback': '6.5'}
        ]
    },
    {
        'text': '*20. Какое слово является лишним? *\nШОКОЛАД : Картина Автомобиль Лев Ящик Шлем Зонт Сейф Расческа',
        'buttons': [
            {'text' : 'Картина', 'callback': '0'},
            {'text' : 'Автомобиль', 'callback': '0'},
            {'text' : 'Лев', 'callback': '0'},
            {'text' : 'Ящик', 'callback': '0'},
            {'text' : 'Шлем', 'callback': '0'},
            {'text' : 'Зонт', 'callback': '0'},
            {'text' : 'Сейф', 'callback': '6.5'},
            {'text' : 'Расческа', 'callback': '0'}
        ]
    },
]