


start = {
    'text_1' : '''
        Добро пожаловать!
        Этот бот расскажет тебе как можно заработать маленькие и большие деньги, имея только мобильный телефон. У нас есть много схем для легкого заработка и первую схему можно получить совершенно бесплатно, если привести друзей.
    ''',
    'text_2': '''
    Схема 1: 
        Заработок: в первый раз 3400грн за 40мин, следующие круги быстрее.
        Требования: мобильный телефон, паспорт
        Масштабирование: с каждого друга или родственника можно заработать по 3400грн за 15мин, если у них есть Приват24. Не более 23800грн сумарно.
        Легальность: 100% легально
        Формат: текстовая инструкция + видео''',
    'text_free_1': '''Чтобы получить бесплатно Схему 1, нужно пригласить 10 друзей по твоей ссылке:''',
    'text_free_2': '''Друг считается приглашенным, когда он перешел по ссылке и нажал Start''',
    'text_finish' : 'Поздравляю, задание по приглашению друзей выполнено! ',
    'buttons' : [
        {'text': 'купить за 70€',
        'callback' : 'buy'},
        {'text': 'получить бесплатно',
        'callback' : 'free'}]}

scheme2 = {
    'text_1' : '''Высылаю инструкцию по Схеме 1:
                https://t.me/+ggpDCb0NUo5jOGY6
                Ровно через 1 час, ты получишь информацию о второй, более выгодной схеме. Но, к этому времени, ты должен получить свою прибыль по первой схеме .''',
    'text_2' : '''Надеюсь, ты нашел время, чтобы сделать все по инструкции и заработал свои первые деньги.
                Пришло время поднимать ставки! Вторая схема позволяет зарабатывать больше процентов за круг и без ограничений по суммам! Мы потратили немало сил и ресурсов на поиск схемы, но это того стоило!''',
    'text_3' : '''Схема 2:
                    Заработок: не ограничен. Доход от 6% за круг. Длительность круга 1 час.
                    Требования: мобильный телефон, паспорт
                    Масштабирование: неограниченно''',
    'text_free' : 'Увы, эту схему можно получить только за деньги. Вы же успешно заработали на первой схемке?',
    'buttons' : [
        {'text': 'купить за 90€',
        'callback' : 'buy'},
        {'text': 'получить бесплатно',
        'callback' : 'free'}]
}